stalyatech/micropython/ports/stm32/boards/SMART_ANTENNA/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME       "Smart Antenna"
#define MICROPY_HW_MCU_NAME         "STM32F745"
#define MICROPY_HW_FLASH_FS_LABEL   "SMARTANTENNA"

// Define the frozen script to be executed during boot
#define MICROPY_BOARD_FROZEN_BOOT_FILE "_boot.py"

#define MICROPY_PY_SYS_PLATFORM  		MICROPY_HW_BOARD_NAME
#define MICROPY_PY_HASHLIB          (MICROPY_PY_SSL && MICROPY_SSL_AXTLS)

#ifndef MICROPY_FLOAT_IMPL
#define MICROPY_FLOAT_IMPL          (MICROPY_FLOAT_IMPL_DOUBLE)
#endif

#define MICROPY_HW_HAS_SWITCH       (0)
#define MICROPY_HW_ENABLE_INTERNAL_FLASH_STORAGE (0)
#define MICROPY_HW_HAS_FLASH        (1)
#define MICROPY_HW_ENABLE_RNG       (1)
#define MICROPY_HW_ENABLE_RTC       (1)
#define MICROPY_HW_ENABLE_DAC       (0)
#define MICROPY_HW_ENABLE_USB       (1)
#define MICROPY_HW_USB_FS 					(1)
#define MICROPY_HW_ENABLE_SDCARD    (0)
#define MICROPY_HW_SDCARD_MOUNT_AT_BOOT	(0)
#define MICROPY_HW_SDMMC_BUS_WIDTH  (0)
#define MICROPY_PY_THREAD       		(0)
#define MICROPY_ENABLE_DOC_STRING   (0)

// HSE is 12MHz
// VCOClock = HSE * PLLN / PLLM = 12 MHz * 216 / 6 = 432 MHz
// SYSCLK = VCOClock / PLLP = 432 MHz / 2 = 216 MHz
// USB/SDMMC/RNG Clock = VCOClock / PLLQ = 432 MHz / 9 = 48 MHz
#define MICROPY_HW_CLK_PLLM (6)
#define MICROPY_HW_CLK_PLLN (216)
#define MICROPY_HW_CLK_PLLP (RCC_PLLP_DIV2)
#define MICROPY_HW_CLK_PLLQ (9)

// From the reference manual, for 2.7V to 3.6V
// 151-180 MHz => 5 wait states
// 181-210 MHz => 6 wait states
// 211-216 MHz => 7 wait states
#define MICROPY_HW_FLASH_LATENCY    FLASH_LATENCY_7 // 210-216 MHz needs 7 wait states

// UART config
#define MICROPY_HW_UART1_TX         (pin_B6) // F9H1_TXD GPS2
#define MICROPY_HW_UART1_RX         (pin_B7) // F9H1_RXD GPS2
// #define MICROPY_HW_UART2_TX         (pin_D5) // F9H2_TXD GPS3
// #define MICROPY_HW_UART2_RX         (pin_D6) // F9H2_RXD GPS3
#define MICROPY_HW_UART3_TX         (pin_D8) // SRV_TXD
#define MICROPY_HW_UART3_RX         (pin_D9) // SRV_RXD
#define MICROPY_HW_UART6_TX         (pin_C6) // XBEE_B_TXD
#define MICROPY_HW_UART6_RX         (pin_C7) // XBEE_B_RXD
#define MICROPY_HW_UART7_TX         (pin_E8)// XBEE_A_TXD
#define MICROPY_HW_UART7_RX         (pin_E7)// XBEE_A_RXD
#define MICROPY_HW_UART8_TX         (pin_E1) // F9P_TXD GPS1
#define MICROPY_HW_UART8_RX         (pin_E0) // F9P_RXD GPS1

#define MICROPY_HW_UART_REPL        PYB_UART_3
#define MICROPY_HW_UART_REPL_BAUD   115200

// I2C busses
#define MICROPY_HW_I2C1_SCL         (pin_B8)	// EXT_I2C_SCL
#define MICROPY_HW_I2C1_SDA         (pin_B9)	// EXT_I2C_SDA

#define MICROPY_HW_I2C2_SCL         (pin_B10)	// IBUS_I2C_SCL
#define MICROPY_HW_I2C2_SDA         (pin_B11)	// IBUS_I2C_SDA

// SPI
#define MICROPY_HW_SPI1_NSS         (pin_D7)
#define MICROPY_HW_SPI1_SCK         (pin_B3)
#define MICROPY_HW_SPI1_MISO        (pin_B4)
#define MICROPY_HW_SPI1_MOSI        (pin_B5)

#define MICROPY_HW_SPI4_NSS         (pin_E11)
#define MICROPY_HW_SPI4_SCK         (pin_E12)
#define MICROPY_HW_SPI4_MISO        (pin_E13)
#define MICROPY_HW_SPI4_MOSI        (pin_E14)

// Use external SPI flash for storage
#define MICROPY_HW_SPIFLASH_SIZE_BITS       (128 * 1024 * 1024)
#define MICROPY_HW_SPIFLASH_CS              (pin_D7)
#define MICROPY_HW_SPIFLASH_SCK             (pin_B3)
#define MICROPY_HW_SPIFLASH_MOSI            (pin_B5)
#define MICROPY_HW_SPIFLASH_MISO            (pin_B4)
#define MICROPY_HW_SPIFLASH_ENABLE_CACHE    (1)

extern const struct _mp_spiflash_config_t spiflash_config;
extern struct _spi_bdev_t spi_bdev;
#define MICROPY_HW_BDEV_IOCTL(op, arg) ( \
    (op) == BDEV_IOCTL_NUM_BLOCKS ? (MICROPY_HW_SPIFLASH_SIZE_BITS / 8 / FLASH_BLOCK_SIZE) : \
    (op) == BDEV_IOCTL_INIT ? spi_bdev_ioctl(&spi_bdev, (op), (uint32_t)&spiflash_config) : \
    spi_bdev_ioctl(&spi_bdev, (op), (arg)) \
)
#define MICROPY_HW_BDEV_READBLOCKS(dest, bl, n) spi_bdev_readblocks(&spi_bdev, (dest), (bl), (n))
#define MICROPY_HW_BDEV_WRITEBLOCKS(src, bl, n) spi_bdev_writeblocks(&spi_bdev, (src), (bl), (n))
#define MICROPY_HW_BDEV_SPIFLASH_EXTENDED (&spi_bdev) // for extended block protocol
#define MICROPY_HW_BDEV_SPIFLASH_OFFSET_BYTES	(0)

// LEDs
#define MICROPY_HW_LED1             (pin_A0)    // LED1
#define MICROPY_HW_LED2             (pin_A1)    // LED2
#define MICROPY_HW_LED3             (pin_A2)    // LED3
#define MICROPY_HW_LED4             (pin_A3)    // LED4
#define MICROPY_HW_LED5             (pin_A6)    // LED5
#define MICROPY_HW_LED6             (pin_A7)    // LED6
#define MICROPY_HW_LED_ON(pin)      (mp_hal_pin_high(pin))
#define MICROPY_HW_LED_OFF(pin)     (mp_hal_pin_low(pin))

// USB config (CN13 - USB OTG FS)
#define MICROPY_HW_USB_FS              (1)
#define MICROPY_HW_USB_OTG_ID_PIN      (pin_C2)
// #define MICROPY_HW_USB_HS (1)
// #define MICROPY_HW_USB_HS_IN_FS (1)

// Bootloader configuration
#define MBOOT_FSLOAD 			(1)
#define MBOOT_VFS_FAT 			(1)

// #define MBOOT_SPIFLASH_LAYOUT     "/0x00000000/64*32Kg"
#define MBOOT_SPIFLASH_LAYOUT "/0x80000000/64*32Kg"
#define MBOOT_SPIFLASH_ERASE_BLOCKS_PER_PAGE (32 / 4)
#define MBOOT_SPIFLASH_ADDR     	(0x00000000)
#define MBOOT_SPIFLASH_BYTE_SIZE	(MICROPY_HW_SPIFLASH_SIZE_BITS / 8)
#define MBOOT_SPIFLASH_SPIFLASH 	(&spi_bdev.spiflash)
#define MBOOT_SPIFLASH_CONFIG 		(&spiflash_config)
